Repository: mohamedmamdouh-mm/We_BuildD
Catalog: We_Build/Resources/SharedResource.*.resx
Languages: ar

source: about
ar: عن الشركه

source: about us
ar: عن الشركه

source: architechture design
ar: التصميم المعمارى

source: blogs
ar: التدوين

source: building construction
ar: تشيييد المبانى

source: building maintenance
ar: صيانة المباني

source: building renovation
ar: تجديد المبانى

source: cloud hosting
ar: الاستضافه السحابيه

source: Cloud Solution
ar: الحلول السحابيه

source: Communication
ar: الاتصالات

source: Company
ar: الشركه

source: construction
ar: المقاولات

source: construction consultant
ar: خبير استشارى

source: construction, design
ar: التصميم و البناء

source: contact
ar: تواصل

source: Creativity Corner Company offers the latest security technologies with the best engineers and specialized experts
ar: تقدم الشركه احدث تقنيات الامان مع افضل المهندسين والخبراء المختصين

source: dream home
ar: منزل الاحلام

source: Excellence is the end result of knowing understanding embracing and achieving core values In the fall of 2007 site and office staff met outside to discuss core values We wanted to know what are the absolute principles that define the way New Middle East General Contracting Company operates Actually we wanted an analysis of the company's DNA
ar: الامتياز هو النتيجة النهائية لمعرفة وفهم واحتضان وتحقيق القيم الأساسية . ففي خريف عام 2007 التقى العاملين الموقع والمكتب خارجاً لمناقشة القيم الأساسية .أردنا أن نعرف ما هي المبادئ المطلقة التي تحدد الطريقة التي تعمل بها شركة الشرق الأوسط الجديد للمقاولات العامة . فعلياً أردنا تحليلاً للحمض النووي للشركة

source: Fiber Obtics
ar: الالياف الضوئيه

source: fiber obtics product
ar: الالياف الضوئيه

source: get started
ar: يمكنك البدء

source: Hello
ar: مرحبا

source: help the project owner obtain all the necessary building and trade-specific permits to complete the project
ar: مساعدة صاحب المشروع في الحصول على جميع التصاريح اللازمة للبناء والتجارة لإكمال المشروع

source: Home
ar: الصفخه الرئيسيه

source: house renovation
ar: تجديد المنازل

source: interior design
ar: التصميم الداخلي

source: Internet of Things
ar: انترنت الاشياء

source: is at forefront in the field of building and maintaing communication network
ar: نحن في الصدارة في مجال بناء وصيانة شبكة الاتصالات

source: IT &amp; Communication
ar: تكنولوجيا المعلومات والاتصالات

source: IT Services offers a full range of cloud strategic services to help your business take full advantage of cloud computing
ar: تقدم خدمات تكنولوجيا المعلومات مجموعة كاملة من الخدمات الاستراتيجية السحابية لمساعدة أعمالك على الاستفادة الكاملة من الحوسبة السحابية

source: It was established in 2005 to participate in and make a contributetion towards the monumental tasks require to develop the modern nation state it is today
ar: تأسست في عام 2005 للمشاركة والمساهمة في المهام الضخمة اللازمة لتطوير الدولة القومية الحديثة التي هي عليها اليوم

source: make indoor spaces functional, safe, and beautiful by determining space requirements and selecting essential and decorative items
ar: جعل المساحات الداخلية عملية وآمنة وجميلة من خلال تحديد متطلبات المساحة واختيار العناصر الأساسية والديكورية

source: material supply
ar: إمدادات المواد

source: Materials and supplies are deemed to include goods used as inputs in a production process
ar: تعتبر المواد واللوازم تشمل السلع المستخدمة كمدخلات في عملية الإنتاج

source: Network Solution
ar: حلول الشبكات

source: Network Solution allow a flexible and secure connection to your business anytime and anywhere
ar: يسمح حل الشبكة باتصال مرن وآمن بعملك في أي وقت وفي أي مكان

source: New Middle East General Communication Company
ar: شركة الاتصالات العامة الجديدة في الشرق الأوسط

source: New Middle East General Contracting Company core values
ar: شركة الشرق الأوسط الجديد للمقاولات العامة القيم الأساسية

source: NEW MIDDLE EST
ar: الشرق الاوسط الجديد

source: our projects
ar: مشاريعنا

source: our services
ar: خدماتنا

source: Our sincerity reflects our honesty and integrity in our dealings with our customers and employees. Teamwork has been an integral part of our culture since the company was founded in 2005. And of course teamwork has to influence without mutual respect respect and consideration
ar: اخلاصنا يعكس امانتنا ونزاهتنا في تعاملنا مع عملائنا وموظفينا . العمل الجماعي بات جزءاً لا يتجزأ من ثقافتنا منذ تأسست الشركة عام 2005 . وبالطبع أنى للعمل الجماعي أن يؤثر دون تواصل مراعى ومنفتح واحترام متبادل بيننا

source: our vission
ar: الرؤيه

source: projects
ar: المشاريع

source: regularly and repairing items that are broken It can involve inspecting repairing and maintaining electrical systems
ar: بانتظام، وإصلاح العناصر المكسورة. ويمكن أن يشمل ذلك فحص وإصلاح وصيانة الأنظمة الكهربائية

source: Road Blocker system-hydraulic security fendders
ar: حواجز الامن الهيدروليكية

source: security barriers
ar: الحواجز الامنيه

source: security surveillance Cameras
ar: كاميرات المراقبه الامنيه

source: smart home , Sensors , Power Sources , Discovery Service
ar: المنزل الذكي، أجهزة الاستشعار، مصادر الطاقة، خدمة الاكتشاف

source: Sservices
ar: الخدمات

source: Telecom Infrastructure
ar: البنيه التحيه للاتصالات

source: the designing and planning of structures where functionality and aesthetics are the two key elements of the process
ar: تصميم وتخطيط الهياكل حيث تكون الوظيفة والجماليات العنصرين الرئيسيين للعملية

source: the process of adding structure to real property via various techniques
ar: عملية إضافة البنية إلى الممتلكات العقارية من خلال تقنيات مختلفة.

source: the process of repairing and improving a building so that it is in good condition again
ar: إصلاح وتحسين المبنى بحيث يصبح في حالة جيدة مرة أخرى

source: the structural and technical restoration or modernisation of one or several floors or even an entire existing structure
ar: الترميم الهيكلي والفني، أو تحديث طابق واحد أو عدة طوابق أو حتى مبنى قائم بالكامل

source: the technology that transmits information as light pulses along a glass or plastic fiber
ar: التكنولوجيا التي تنقل المعلومات على شكل نبضات ضوئية على طول زجاج أو ألياف بلاستيكية

source: To be recognized as the leader in the local market in the areas of Consultation Constraction Training Designing and Implementing Turnkey projects offering clients a full range of service
ar: أن يتم الاعتراف بها كشركة رائدة في السوق المحلية في مجالات التدريب التقييدي الاستشاري تصميم وتنفيذ مشاريع تسليم المفتاح التي تقدم للعملاء مجموعة كاملة من الخدمات

source: To be recognized as the leader in the local market in the areas of Consultation , Constraction , Training , Designing and Implementing projects offering clients a full range of service
ar: أن يتم الاعتراف بها كشركة رائدة في السوق المحلية في مجالات التشاور والتقييد والتدريب والتصميم وتنفيذ المشاريع التي تقدم للعملاء مجموعة كاملة من الخدمات

source: We will provide you the best work which you dreamt for
ar: سنقدم لك أفضل عمل كنت تحلم به
